# Задачв № 2. Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
# Пример:
# пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

# нахождение факториала
def fact(n):
    result = 1
    for i in range(2, n+1):
        result *= i
    return result


number = int(input("введите натуральное число = "))
some_list = []  # список для вывода
for i in range(1, number+1):
    some_list.append(fact(i))  # добавляем в конец списка элемент
print(some_list)